# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shopify/shopify'


# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'redis'
brew 'yarn'
brew 'gh'
brew 'shopify-cli'

# Productivity Apps
cask '1password'
cask 'appcleaner'
cask 'google-drive'
cask 'notion'
cask 'the-unarchiver'
cask 'shiftit'
cask 'sky-ticket'
cask 'spotify'


# Chats / Messenger
cask 'discord'
cask 'microsoft-teams'
cask 'slack'
cask 'whatsapp'
cask 'zoom'

# Development Tools
cask 'dbngin'
cask 'docker'
cask 'helo' # E-Mail Testing
cask 'insomnia'
cask 'phpmon'
cask 'phpstorm'
cask 'tableplus'
cask 'iterm2'
cask 'termius' # SSH Client
cask 'tinkerwell' # Smart PHP Testing Tool
cask 'tower'
cask 'transmit'
cask 'visual-studio-code'
# cask 'tuple' # Pair Programmiung Tool 
# cask 'ray' # PHP Debuggin Tool

# Design, Video & Graphics
cask 'abstract'
cask 'adobe-creative-cloud'
cask 'adobe-acrobat-pro'
cask 'figma'
cask 'sketch'
cask 'imageoptim'

# Browsers & Web
cask 'google-chrome'
cask 'firefox'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-dosis'
cask 'font-heebo'
cask 'font-work-sans'
cask 'font-overpass'
cask 'font-noto-sans'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 361309726
mas 'MindNode', id: 1218718027 # Flowcharts & Sitemaps
# mas 'Magnet', id: 441258766 # Window Manager
